results/routeA/initialization_check/A-Ra1e6-medium/constant/momentumTransport
FoamFile
{
    format ascii;
    class dictionary;
    location "constant";
    object momentumTransport;
}
simulationType laminar;
