results/routeA/initialization_check/A-Ra1e6-medium/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
6400
(
-0.0880281690140845
-0.0880281690140845
-0.0880281690140845
-0.0880281690140845
-0.0880281690140845
-0.0880281690140845
-0.0880281690140845
-0.0880281690140845
...
)
;

boundaryField
{
    hotWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
-0.08798415492957747
-0.2639524647887324
-0.4399207746478873
-0.6158890845070423
-0.7918573943661972
-0.9678257042253521
-1.143794014084507
-1.319762323943662
...
)
;
    }
    coldWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
-0.08807218309859155
-0.2642165492957746
-0.4403609154929577
-0.6165052816901408
-0.7926496478873239
-0.968794014084507
-1.14493838028169
-1.321082746478873
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           uniform -14.08450704225352;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
