results/routeA/initialization_check/A-Ra1e6-medium/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
6400
(
0
0
0
0
-2.775557561562891e-17
0
0
-1.387778780781446e-17
...
)
;

boundaryField
{
    hotWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
80
(
0
-5.551115123125783e-17
-1.110223024625157e-16
1.110223024625157e-16
1.110223024625157e-16
0
0
-2.220446049250313e-16
...
)
;
    }
    coldWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
80
(
0
-5.551115123125783e-17
-1.665334536937735e-16
0
0
-1.110223024625157e-16
-2.220446049250313e-16
-4.440892098500626e-16
...
)
;
    }
    bottomWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    topWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
80
(
0
0
3.552713678800501e-15
0
3.552713678800501e-15
0
3.552713678800501e-15
0
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
