results/routeA/initialization_check/A-Ra1e6-medium/0/gh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      gh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
6400
(
-0.0880281690140845
-0.0880281690140845
-0.0880281690140845
-0.0880281690140845
-0.08802816901408447
-0.0880281690140845
-0.0880281690140845
-0.08802816901408449
...
)
;

boundaryField
{
    hotWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
-0.0880281690140845
-0.2640845070422534
-0.4401408450704224
-0.6161971830985916
-0.7922535211267606
-0.9683098591549295
-1.144366197183099
-1.320422535211267
...
)
;
    }
    coldWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
-0.08802816901408451
-0.2640845070422535
-0.4401408450704224
-0.6161971830985916
-0.7922535211267606
-0.9683098591549295
-1.144366197183099
-1.320422535211267
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
-14.08450704225352
-14.08450704225352
-14.08450704225352
-14.08450704225352
-14.08450704225352
-14.08450704225352
-14.08450704225352
-14.08450704225352
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
